{
  "year": "2013",
  "question_number": "6",
  "domain": "Putnam",
  "statement": "",
  "solution": [
    {
      "hint_level": 0,
      "content": "We show that the only winning first move for Alice is to place a stone in the central space. We start with some terminology.\n\n%Divide the playing area into the \\emph{left half}, the \\emph{central %space}, and the \\emph{right half}.\nBy a \\emph{block} of stones, we mean a (possibly empty) sequence of stones occupying consecutive spaces. By the \\emph{extremal blocks}, we mean the (possibly empty) maximal blocks adjacent to the left and right ends of the playing area.\n\nWe refer to a legal move consisting of placing a stone in an empty space as a move of \\emph{type 1}, and any other legal move as being of \\emph{type 2}.\nFor $i=0,\\dots,n$, let $P_i$ be the collection of positions containing $i$ stones. Define the \\emph{end zone} as the union $Z = P_{n-1} \\cup P_n$. In this language, we make the following observations.\n\\begin{itemize}\n\\item\nAny move of type 1 from $P_i$ ends in $P_{i+1}$.\n\\item\nAny move of type 2 from $P_n$ ends in $P_{n-1}$.\n\\item\nFor $i < n$, any move of type 2 from $P_i$ ends in $P_i \\cup P_{i+1}$.\n\\item\nAt this point, we see that  the number of stones cannot decrease until we reach the end zone.\n\\item\nFor $i < n-1$, if we start at a position in $P_i$ where the extremal blocks have length $a,b$, then the only possible moves to $P_i$ decrease one of $a,b$ while leaving the other unchanged (because they are separated by at least two empty spaces). In particular, no repetition is possible within $P_i$, so the number of stones must eventually increase to $i+1$.\n\\item\nFrom any position in the end zone, the legal moves are precisely to the other positions in the end zone which have not previously occurred. Consequently, after the first move into the end zone, the rest of the game consists of enumerating all positions in the end zone in some order.\n\\item\nAt this point, we may change the rules without affecting the outcome by eliminating the rule on repetitions and declaring that the first player to move into the end zone loses (because $\\# Z = n+1$ is even)."
    }
  ]
}