{
  "year": "2017",
  "question_number": "6",
  "domain": "Putnam",
  "statement": "",
  "solution": [
    {
      "hint_level": 0,
      "content": "The number of such colorings is $2^{20} 3^{10} = 61917364224$.\n\n\\noindent\n\\textbf{First solution:}\nIdentify the three colors red, white, and blue with (in some order) the elements of the field $\\mathbb{F}_3$ of three elements (i.e., the ring of integers mod 3). \nThe set of colorings may then be identified with the $\\mathbb{F}_3$-vector space $\\mathbb{F}_3^E$\ngenerated by the set $E$ of edges. Let $F$ be the set of faces, and let $\\mathbb{F}_3^F$ be the $\\mathbb{F}_3$-vector space on the basis $F$; we may then define a linear transformation\n$T: \\mathbb{F}_3^E \\to \\mathbb{F}_3^F$ taking a coloring to the vector whose component corresponding to a given face equals the sum of the three edges of that face. The colorings we wish to count are the ones whose images under $T$ consist of vectors with no zero components.\n\nWe now show that $T$ is surjective. (There are many possible approaches to this step; for instance, see the following remark.) \nLet $\\Gamma$ be the dual graph of the icosahedron, that is, $\\Gamma$ has vertex set $F$ and two elements of $F$ are adjacent in $\\Gamma$ if they share an edge in the icosahedron. The graph $\\Gamma$ admits a hamiltonian path, that is, there exists an ordering\n$f_1,\\dots,f_{20}$ of the faces such that any two consecutive faces are adjacent in $\\Gamma$. \nFor example, such an ordering can be constructed with $f_1,\\dots,f_5$ being the five faces sharing a vertex of the icosahedron and $f_{16},\\dots,f_{20}$ being the five faces sharing the antipodal vertex.\n\nFor $i=1,\\dots,19$, let $e_i$ be the common edge of $f_i$ and $f_{i+1}$; these are obviously all distinct.\nBy prescribing components for $e_1,\\dots,e_{19}$ in turn and setting the others to zero,\nwe can construct an element of $\\mathbb{F}_3^E$ whose image under $T$ matches any given vector of $\\mathbb{F}_3^F$ in the components of $f_1,\\dots,f_{19}$. The vectors in $\\mathbb{F}_3^F$ obtained in this way thus form a 19-dimensional subspace; this subspace may also be described as the vectors for which the components of $f_1,\\dots,f_{19}$ have the same sum as the components of $f_{2},\\dots,f_{20}$. \n\nBy performing a mirror reflection, we can construct a second hamiltonian path $g_1,\\dots,g_{20}$ with the property that\n\\[\ng_1 = f_1, g_2 = f_5, g_3 = f_4, g_4 = f_3, g_5 = f_2.\n\\]\nRepeating the previous construction, we obtain a \\emph{different} 19-dimensional subspace of $\\mathbb{F}_3^F$ which is contained in the image of $T$. This implies that $T$ is surjective, as asserted earlier.\n\nSince $T$ is a surjective homomorphism from a 30-dimensional vector space to a 20-dimensional vector space, it has a 10-dimensional kernel. Each of the $2^{20}$ elements of $\\mathbb{F}_3^F$ with no zero components is then the image of exactly $3^{10}$ colorings of the desired form, yielding the result.\n\n\\noindent\n\\textbf{Remark:}\nThere are many ways to check that $T$ is surjective. One of the simplest is the following\n(from Art of Problem Solving, user \\texttt{Ravi12346}): form a vector in $\\mathbb{F}^E$ with components $2,1,2,1,2$ at the five edges around some vertex and all other components 0. This maps to a vector in $\\mathbb{F}^F$ with only a single nonzero component; by symmetry, every standard basis vector of $\\mathbb{F}^F$ arises in this way.\n\n\\noindent\n\\textbf{Second solution:}\n(from Bill Huang, via Art of Problem Solving user \\texttt{superpi83})\nLet $v$ and $w$ be two antipodal vertices of the icosahedron. Let $S_v$ (resp.\\ $S_w$) be the set of five edges incident to $v$ (resp.\\ $w$). Let $T_v$ (resp.\\ $T_w$) be the set of five edges of the pentagon formed by the opposite endpoints of the five edges in $S_v$ (resp. $S_w$). Let $U$ be the set of the ten remaining edges of the icosahedron.\n\nConsider any one of the $3^{10}$ possible colorings of $U$. The edges of $T_v \\cup U$ form the boundaries of five faces with no edges in common; thus each edge of $T_v$ can be colored in one of two ways consistent with the given condition,\nand similarly for $T_w$. That is, there are $3^{10} 2^{10}$ possible colorings of $T_v \\cup T_w \\cup U$ consistent with the given condition.\n\nTo complete the count, it suffices to check that there are exactly $2^5$ ways to color $S_v$ consistent with any given coloring of $T_v$. Using the linear-algebraic interpretation from the first solution, this follows by observing that\n(by the previous remark) the map from $\\mathbb{F}_3^{S_v}$ to the $\\mathbb{F}_3$-vector space on the faces incident to $v$ is surjective, and hence an isomorphism for dimensional reasons. A direct combinatorial proof is also possible."
    }
  ]
}