{
  "year": "2024",
  "question_number": "2",
  "domain": "Putnam",
  "statement": "",
  "solution": [
    {
      "hint_level": 0,
      "content": "No, there is no such sequence. In other words, any sequence of convex quadrilaterals with the property that any two consecutive terms are partners must be finite.\n\n\\noindent\n\\textbf{First solution.}\n\n\\begin{lemma*}\nGiven five positive real numbers $a,b,c,d,K$, there are only finitely many convex quadrilaterals with side lengths $a,b,c,d$ in that order and area $K$. \n\\end{lemma*}\n\\begin{proof}\nLet $PQRS$ be a convex quadrilateral with \n\\[\n\\overline{PQ} = a, \\overline{QR} = b, \\overline{RS} = c, \\overline{SP} = d.\n\\]\nThen the congruence class of $PQRS$ is uniquely determined by the length of the diagonal $f := \\overline{PR}$.\nMoreover, as $f$ increases, the angles $\\angle RPQ$ and $\\angle RPS$ are both strictly decreasing, so $\\angle SPQ$ is decreasing; by the same logic, $\\angle QRS$ is decreasing. \n\nWe next recall \\emph{Bretschneider's formula}: for $s = (a+b+c+d)/2$,\n\\[\nK^2 = (s-a)(s-b)(s-c)(s-d) - abcd \\cos^2 \\frac{\\angle SPQ + \\angle QRS}{2}.\n\\]\nConsequently, fixing $K$ also fixes $\\cos^2 \\frac{\\angle SPQ + \\angle QRS}{2}$,\nand thus limits $\\angle SPQ + \\angle QRS$ to one of two values. By the previous paragraph, this leaves at most two possible congruence classes for the triangle.\n\\end{proof}\n\nReturning to our original sequence, note that any two consecutive quadrilaterals in the sequence have the same area and the same unordered list of side lengths. The latter can occur as an ordered list in at most six different ways (up to cyclic shift); for each of these, we can have only finitely many distinct congruence classes of quadrilaterals in our sequence with that area and ordered list of side lengths. We deduce that our sequence must be finite.\n\n\\noindent\n\\textbf{Remark.}\nVarious proofs of the lemma are possible; for example, here is one using Cartesian coordinates. We \nfirst specify \n\\[\nP = (0,0), Q = (a, 0).\n\\]\nFor two additional points $R = (x,y),S = (z,w)$, the conditions $\\overline{QR} = b$, $\\overline{SP} = d$ restrict $R$ and $S$ to the circles\n\\[\n(x-a)^2 + y^2 = b^2, \\quad\nz^2+w^2 = d^2\n\\]\nrespectively. Since we want a convex quadrilateral, we may assume without loss of generality that $y,w > 0$.\nThe area of the quadrilateral is $\\frac{1}{2} a(y+w)$, which we also want to fix; we may thus regard $w$ as a function of $y$ (possibly restricting $y$ to a range for which $w>0$). After splitting the semicircles on which $R$ and $S$ lie into two arcs each, we may also regard $x$ and $w$ as functions of $y$. It now suffices to observe that $\\overline{RS}^2 = (z-x)^2 + (w-y)^2$\nis a nonconstant algebraic function of $y$, so it takes any given value only finitely many times.\n\n\\noindent\n\\textbf{Second solution.}\nLet $ABCD$ be the first quadrilateral in the sequence.\nSince the quadrilateral is convex, the diagonals $\\overline{AC}$ and $\\overline{BD}$ intersect. In particular they are not parallel, so their perpendicular bisectors are not parallel either; let $O$ be the intersection\nof the bisectors.\n\nWe claim that the point $O$ remains fixed throughout the sequence, as do the distances $OA, OB, OC, OD$. To see this, we check this for two partners as described in the problem statement: the diagonal $\\overline{BD}$ gets reflected across the perpendicular bisector of $\\overline{AC}$, so its perpendicular bisector also gets reflected; the point $O$ is the unique point on the perpendicular bisector of $\\overline{BD}$ fixed by the reflection. In particular, the segments $\\overline{OD}$ and $\\overline{OE}$ are mirror images across the perpendicular bisector of $\\overline{AC}$, so their lengths coincide.\n\nAs noted in the first solution, the unordered list of side lengths of the quadrilateral also remains invariant throughout the sequence. Consequently, the unordered list of side lengths of each of the triangles $\\triangle OAB, \\triangle OBC, \\triangle OCD, \\triangle ODA$ is limited to a finite set;\neach such list uniquely determines the unoriented congruence class of the corresponding triangle,\nand limits the oriented congruence class to two possibilities. Given the oriented congruence classes of the four triangles we can reconstruct the quadrilateral $ABCD$ up to oriented congruence (even up to rotation around $O$); this proves that the sequence must be finite."
    }
  ]
}